; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v8 ?v5)
             (pred_10 ?v10 ?v3)
             (pred_7 ?v8 ?v3)
             (pred_2 ?v6 ?v8 )
	     (pred_9 ?v8)
             (pred_6 ?v7)
             (pred_12 ?v10)
             (pred_4 ?v3)
             (pred_3 ?v8)
             (pred_5 ?v10)
             (pred_11 ?v8)
             (pred_8 ))



(:action op_4
:parameters (?v2 ?v11 ?v4 ?v1)
:precondition (and (pred_6 ?v2) (pred_6 ?v11) (pred_12 ?v4) (pred_4 ?v1)
          (pred_1 ?v2 ?v11) (pred_10 ?v4 ?v1)
                   (pred_7 ?v11 ?v1) (pred_9 ?v2) 
                   (pred_3 ?v11) (pred_5 ?v4))
:effect (and  (pred_11 ?v11) (not (pred_3 ?v11))))


(:action op_5
:parameters (?v2 ?v9)
:precondition (and (pred_6 ?v2) (pred_6 ?v9)
               (pred_9 ?v2) (pred_1 ?v2 ?v9) (pred_11 ?v9))
:effect (and (pred_9 ?v9) (not (pred_9 ?v2))))

(:action op_3
:parameters (?v2 ?v4)
:precondition (and (pred_6 ?v2) (pred_12 ?v4) 
                  (pred_9 ?v2) (pred_2 ?v4 ?v2) (pred_8 ))
:effect (and (pred_5 ?v4)
   (not (pred_2 ?v4 ?v2)) (not (pred_8 ))))


(:action op_2
:parameters (?v2 ?v12 ?v13)
:precondition (and (pred_6 ?v2) (pred_12 ?v12) (pred_12 ?v13)
                  (pred_9 ?v2) (pred_5 ?v13) (pred_2 ?v12 ?v2))
:effect (and (pred_5 ?v12) (pred_2 ?v13 ?v2)
        (not (pred_5 ?v13)) (not (pred_2 ?v12 ?v2))))

(:action op_1
:parameters (?v2 ?v4)
:precondition (and (pred_6 ?v2) (pred_12 ?v4) 
                  (pred_9 ?v2) (pred_5 ?v4))
:effect (and (pred_8 ) (pred_2 ?v4 ?v2) (not (pred_5 ?v4)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_06 obj_22 obj_32 obj_15 obj_24 obj_11 obj_17 obj_23 obj_05 obj_30 obj_18 obj_16 obj_29 obj_10 obj_28 obj_27 obj_12 obj_08 obj_25 obj_13 obj_02 obj_26 obj_31 obj_21 obj_03
    obj_14 obj_19 obj_07
    obj_04 obj_09 obj_01 obj_20
    )

    (:init
       (pred_8)

       (pred_6 obj_06)
       (pred_6 obj_22)
       (pred_6 obj_32)
       (pred_6 obj_15)
       (pred_6 obj_24)
       (pred_6 obj_11)
       (pred_6 obj_17)
       (pred_6 obj_23)
       (pred_6 obj_05)
       (pred_6 obj_30)
       (pred_6 obj_18)
       (pred_6 obj_16)
       (pred_6 obj_29)
       (pred_6 obj_10)
       (pred_6 obj_28)
       (pred_6 obj_27)
       (pred_6 obj_12)
       (pred_6 obj_08)
       (pred_6 obj_25)
       (pred_6 obj_13)
       (pred_6 obj_02)
       (pred_6 obj_26)
       (pred_6 obj_31)
       (pred_6 obj_21)
       (pred_6 obj_03)
       (pred_4 obj_14)
       (pred_4 obj_19)
       (pred_4 obj_07)
       (pred_12 obj_04)
       (pred_12 obj_09)
       (pred_12 obj_01)
       (pred_12 obj_20)

       (pred_1 obj_06 obj_11)
       (pred_1 obj_06 obj_22)
       (pred_1 obj_22 obj_17)
       (pred_1 obj_22 obj_32)
       (pred_1 obj_22 obj_06)
       (pred_1 obj_32 obj_23)
       (pred_1 obj_32 obj_15)
       (pred_1 obj_32 obj_22)
       (pred_1 obj_15 obj_05)
       (pred_1 obj_15 obj_24)
       (pred_1 obj_15 obj_32)
       (pred_1 obj_24 obj_30)
       (pred_1 obj_24 obj_15)
       (pred_1 obj_11 obj_18)
       (pred_1 obj_11 obj_17)
       (pred_1 obj_11 obj_06)
       (pred_1 obj_17 obj_16)
       (pred_1 obj_17 obj_23)
       (pred_1 obj_17 obj_22)
       (pred_1 obj_17 obj_11)
       (pred_1 obj_23 obj_29)
       (pred_1 obj_23 obj_05)
       (pred_1 obj_23 obj_32)
       (pred_1 obj_23 obj_17)
       (pred_1 obj_05 obj_10)
       (pred_1 obj_05 obj_30)
       (pred_1 obj_05 obj_15)
       (pred_1 obj_05 obj_23)
       (pred_1 obj_30 obj_28)
       (pred_1 obj_30 obj_24)
       (pred_1 obj_30 obj_05)
       (pred_1 obj_18 obj_27)
       (pred_1 obj_18 obj_16)
       (pred_1 obj_18 obj_11)
       (pred_1 obj_16 obj_12)
       (pred_1 obj_16 obj_29)
       (pred_1 obj_16 obj_17)
       (pred_1 obj_16 obj_18)
       (pred_1 obj_29 obj_08)
       (pred_1 obj_29 obj_10)
       (pred_1 obj_29 obj_23)
       (pred_1 obj_29 obj_16)
       (pred_1 obj_10 obj_25)
       (pred_1 obj_10 obj_28)
       (pred_1 obj_10 obj_05)
       (pred_1 obj_10 obj_29)
       (pred_1 obj_28 obj_13)
       (pred_1 obj_28 obj_30)
       (pred_1 obj_28 obj_10)
       (pred_1 obj_27 obj_02)
       (pred_1 obj_27 obj_12)
       (pred_1 obj_27 obj_18)
       (pred_1 obj_12 obj_26)
       (pred_1 obj_12 obj_08)
       (pred_1 obj_12 obj_16)
       (pred_1 obj_12 obj_27)
       (pred_1 obj_08 obj_31)
       (pred_1 obj_08 obj_25)
       (pred_1 obj_08 obj_29)
       (pred_1 obj_08 obj_12)
       (pred_1 obj_25 obj_21)
       (pred_1 obj_25 obj_13)
       (pred_1 obj_25 obj_10)
       (pred_1 obj_25 obj_08)
       (pred_1 obj_13 obj_03)
       (pred_1 obj_13 obj_28)
       (pred_1 obj_13 obj_25)
       (pred_1 obj_02 obj_26)
       (pred_1 obj_02 obj_27)
       (pred_1 obj_26 obj_31)
       (pred_1 obj_26 obj_12)
       (pred_1 obj_26 obj_02)
       (pred_1 obj_31 obj_21)
       (pred_1 obj_31 obj_08)
       (pred_1 obj_31 obj_26)
       (pred_1 obj_21 obj_03)
       (pred_1 obj_21 obj_25)
       (pred_1 obj_21 obj_31)
       (pred_1 obj_03 obj_13)
       (pred_1 obj_03 obj_21)
       (pred_3 obj_11)
       (pred_3 obj_31)
       (pred_3 obj_06)
       (pred_3 obj_29)
       (pred_7  obj_11 obj_14)
       (pred_7  obj_31 obj_19)
       (pred_7  obj_06 obj_07)
       (pred_7  obj_29 obj_07)
       (pred_11 obj_22)
       (pred_11 obj_32)
       (pred_11 obj_15)
       (pred_11 obj_24)
       (pred_11 obj_17)
       (pred_11 obj_23)
       (pred_11 obj_05)
       (pred_11 obj_30)
       (pred_11 obj_18)
       (pred_11 obj_16)
       (pred_11 obj_10)
       (pred_11 obj_28)
       (pred_11 obj_27)
       (pred_11 obj_12)
       (pred_11 obj_08)
       (pred_11 obj_25)
       (pred_11 obj_13)
       (pred_11 obj_02)
       (pred_11 obj_26)
       (pred_11 obj_21)
       (pred_11 obj_03)

       (pred_10  obj_04 obj_14)
       (pred_10  obj_09 obj_19)
       (pred_10  obj_01 obj_07)
       (pred_10  obj_20 obj_14)
       (pred_2 obj_04 obj_10)
       (pred_2 obj_09 obj_28)
       (pred_2 obj_01 obj_08)
       (pred_2 obj_20 obj_16)
       (pred_9 obj_13)
    )

    (:goal (and
       (pred_2 obj_04 obj_12)
    ))
(:constraints
  (always (not (pred_9 obj_25)))
)
)

; plan
1. (op_5 obj_13 obj_28)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_28)
   goals met: 0 of 1
2. (op_5 obj_28 obj_10)
   deleted: (pred_9 obj_28)
   added: (pred_9 obj_10)
   goals met: 0 of 1
3. (op_3 obj_10 obj_04)
   deleted: (pred_2 obj_04 obj_10) (pred_8)
   added: (pred_5 obj_04)
   goals met: 0 of 1
4. (op_5 obj_10 obj_05)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_05)
   goals met: 0 of 1
5. (op_5 obj_05 obj_23)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_23)
   goals met: 0 of 1
6. (op_5 obj_23 obj_17)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_17)
   goals met: 0 of 1
7. (op_5 obj_17 obj_16)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_16)
   goals met: 0 of 1
8. (op_5 obj_16 obj_12)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_12)
   goals met: 0 of 1
9. (op_1 obj_12 obj_04)
   deleted: (pred_5 obj_04)
   added: (pred_8) (pred_2 obj_04 obj_12)
   goals met: 1 of 1
